In [17]:
import pandas as pd
import numpy as np
import warnings

# Ignore warnings
warnings.filterwarnings("ignore")

# Enable inline plotting for matplotlib
%matplotlib inline

### 1. Date_of_Journey column seperate

In [5]:
df = pd.read_excel('flight_price.xlsx')

In [6]:
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

In [13]:
dff = df[['Date_of_Journey', 'Dep_Time']]

dff.head()

  Date_of_Journey Dep_Time
0      24/03/2019    22:20
1       1/05/2019    05:50
2       9/06/2019    09:25
3      12/05/2019    18:05
4      01/03/2019    16:50

In [18]:
dff['Day'] = dff['Date_of_Journey'].str.split('/').str[0]
dff['Month'] = dff['Date_of_Journey'].str.split('/').str[1]
dff['Year'] = dff['Date_of_Journey'].str.split('/').str[2]

In [19]:
dff.head()

  Date_of_Journey Dep_Time Day Month  Year
0      24/03/2019    22:20  24    03  2019
1       1/05/2019    05:50   1    05  2019
2       9/06/2019    09:25   9    06  2019
3      12/05/2019    18:05  12    05  2019
4      01/03/2019    16:50  01    03  2019

### 2 .Split Arrival_time column

In [28]:
dff2 = df[['Arrival_Time']]

dff2.head()

   Arrival_Time
0  01:10 22 Mar
1         13:15
2  04:25 10 Jun
3         23:30
4         21:35

In [29]:
dff2['Arrival_Hours'] = dff2['Arrival_Time'].str.split(' ').str[0].str.split(':').str[0]
dff2['Arrival_min'] = dff2['Arrival_Time'].str.split(' ').str[0].str.split(':').str[1]

In [30]:
dff2.head()

   Arrival_Time Arrival_Hours Arrival_min
0  01:10 22 Mar            01          10
1         13:15            13          15
2  04:25 10 Jun            04          25
3         23:30            23          30
4         21:35            21          35

In [ ]:
### 3.Split Duration Column and chnge there Datatypes

In [31]:
dff3 = df[['Duration']]

In [32]:
dff3.head()

  Duration
0   2h 50m
1   7h 25m
2      19h
3   5h 25m
4   4h 45m

In [35]:
dff3['Dur_hr'] = dff3['Duration'].str.split(' ').str[0].str.split('h').str[0]
dff3['Dur_min'] = dff3['Duration'].str.split(' ').str[1].str.split('m').str[0]

In [36]:
dff3.head()

  Duration Dur_hr Dur_min
0   2h 50m      2      50
1   7h 25m      7      25
2      19h     19     NaN
3   5h 25m      5      25
4   4h 45m      4      45

## Practise set 2

In [37]:
df = pd.read_csv('orders.csv')

In [38]:
df.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

### converting to Datetime

In [43]:
df['date'] = pd.to_datetime(df['date'])

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [47]:
df['year'] = df['date'].dt.year
df['quarter']= df['date'].dt.quarter
df['Month'] = df['date'].dt.month
df['Month_name'] =  df['date'].dt.month_name()
df['day'] = df['date'].dt.day
df['day_name'] =  df['date'].dt.day_name()
df['week'] = df['date'].dt.week
df['semester'] = np.where(df['quarter'].isin([1,2]),1,2)

In [48]:
df.head()

,date,product_id,city_id,orders,year,quarter,Month,Month_name,day,day_name,week,semester
0,2019-12-10,5628,25,3,2019,4,12,December,10,Tuesday,50,2
1,2018-08-15,3646,14,157,2018,3,8,August,15,Wednesday,33,2
2,2018-10-23,1859,25,1,2018,4,10,October,23,Tuesday,43,2
3,2019-08-17,7292,25,1,2019,3,8,August,17,Saturday,33,2
4,2019-01-06,4344,25,3,2019,1,1,January,6,Sunday,1,1

In [49]:
# is weekend?

df['date_is_weekend'] = np.where(df['day_name'].isin(['Sunday', 'Saturday']), 1,0)

In [50]:
df['date_is_weekend']

0      0
1      0
2      0
3      1
4      1
      ..
995    0
996    0
997    0
998    1
999    0
Name: date_is_weekend, Length: 1000, dtype: int32


#### Extract Time elapsed between dates

In [51]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2024, 2, 26, 0, 6, 10, 691103)

In [52]:
today - df['date']

0     1539 days 00:06:10.691103
1     2021 days 00:06:10.691103
2     1952 days 00:06:10.691103
3     1654 days 00:06:10.691103
4     1877 days 00:06:10.691103
                 ...
995   1967 days 00:06:10.691103
996   1908 days 00:06:10.691103
997   1756 days 00:06:10.691103
998   1821 days 00:06:10.691103
999   1595 days 00:06:10.691103
Name: date, Length: 1000, dtype: timedelta64[ns]

### Practice set .3

In [53]:
df = pd.read_csv('messages.csv')

In [54]:
df.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [56]:
df['date']= pd.to_datetime(df['date'])

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [58]:

df['hour'] = df['date'].dt.hour
df['min'] = df['date'].dt.minute
df['sec'] = df['date'].dt.second

In [61]:
# xtract time 

df['time'] = df['date'].dt.time

df.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [ ]:
# time difference

In [62]:

today - df['date']

0     3724 days 23:16:10.691103
1     3589 days 00:26:10.691103
2     4074 days 23:45:10.691103
3     3376 days 23:35:10.691103
4     3774 days 00:55:10.691103
                 ...
995   4363 days 23:16:10.691103
996   3685 days 00:52:10.691103
997   4150 days 00:29:10.691103
998   4266 days 00:32:10.691103
999   3538 days 00:41:10.691103
Name: date, Length: 1000, dtype: timedelta64[ns]